#+TITLE:	Responsive Portfolio Tutorial
#+SUBTITLE:	Log
#+DATE:		2023-05-19 16:03:11-04:00
#+LASTMOD: 2023-05-27 06:28:41-0400 (EDT)
#+OPTIONS:	toc:nil num:nil
#+STARTUP:	indent show3levels
#+CATEGORIES[]:	Tutorials
#+TAGS[]:	log websites html css sass npm javascript portfolios traversymedia

* Saturday, May 27, 2023
:LOGBOOK:
CLOCK: [2023-05-27 Sat 06:30]
:END:

* Tuesday, May 23, 2023
:LOGBOOK:
CLOCK: [2023-05-23 Tue 21:00]--[2023-05-23 Tue 22:37] =>  1:37
:END:

* Monday, May 22, 2023
:LOGBOOK:
CLOCK: [2023-05-22 Mon 08:15]--[2023-05-22 Mon 11:30] =>  3:15
:END:
- I finally got the menu button to appear.  It's like Brad said in the video, ~npm run sass~ didn't detect the file changes
** Menu Button
** Overlay
:LOGBOOK:
CLOCK: [2023-05-22 Mon 12:15]--[2023-05-22 Mon 13:15] =>  1:00
:END:

* Sunday, May 21, 2023
:LOGBOOK:
CLOCK: [2023-05-21 Sun 16:00]--[2023-05-21 Sun 18:43] =>  2:43
CLOCK: [2023-05-21 Sun 06:30]--[2023-05-21 Sun 12:00] =>  5:30
:END:
** Development Environment
*** NPM Packages
- ~node-sass~ - SASS Compiler
- ~gh-pages~ - GitHub Pages
- ~npm-run-all~ - CLI tool to run multiple npm-scripts in parallel or sequentially
*** GO Packages
- ~algernon~ - Live Reload Web Server

* Saturday, May 20, 2023
:LOGBOOK:
CLOCK: [2023-05-20 Sat 08:00]--[2023-05-20 Sat 10:00] =>  2:00
:END:
- No wonder I was confused, yesterday--I was looking at the seventh and last video in a series

* Friday, May 19, 2023
- 
- 

